tutorials/cfdemSolverPiso/ErgunTestMPI_cgs/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    wall
    {
        type            slip;
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue     table
        (
            (0.000 (0 0 0.2))
            (0.010 (0 0 0.2))
            (0.011 (0 0 0.4))
            (0.020 (0 0 0.4))
            (0.021 (0 0 0.6))
            (0.030 (0 0 0.6))
            (0.031 (0 0 0.8))
            (0.040 (0 0 0.8))
            (0.041 (0 0 1.0))
            (0.050 (0 0 1.0))
            (0.051 (0 0 1.2))
            (0.060 (0 0 1.2))
            (0.061 (0 0 1.4))
            (0.070 (0 0 1.4))
            (0.071 (0 0 1.6))
            (0.080 (0 0 1.6))
            (0.081 (0 0 1.8))
            (0.090 (0 0 1.8))
            (0.091 (0 0 2.0))
            (0.100 (0 0 2.0))
        );
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
